export const message = {
  I000010: '該当データがありません。',
  I000060: 'アカウントを削除しました。',
  I000070: '変更内容を保存しました。',
  I000080: 'パスワードを変更しました。',
  I112020: 'パスワードをリセットしてもよろしいですか？',
  I112030: 'パスワードをリセットしました。<br>下記「新しいパスワード」をユーザーに伝えてください。<br><br>新しいパスワード：{0}',
  I203010: '{0}件のデータを一括削除します。本当によろしいですか?(自身のアカウントは削除できません。)',
  I203020: 'すべてのデータを一括削除します。本当によろしいですか。(自身のアカウントは削除できません。)',
  I203030: '{0}件のデータを一括削除します。本当によろしいですか?',
  I204010: '削除してもよろしいですか？',
  I207010: `<p class="u-mb-md">変更内容を保存しました。</p><div class="c-Message--gray">初回パスワード：<span class="u-text-red">{0}</span> </div>`,
  I209010: `<p class="u-mb-md">アカウントを登録しました</p><div class="c-Message--gray">初回パスワード：<span class="u-text-red">{0}</span> </div>`,

  E112110: '新しいパスワードと新しいパスワード(確認)が一致しません。',
  E112120: 'ユーザーIDを含むパスワードは登録できません。',

  logging: '登録中',
  uploading: 'アップロード中',
  ok: 'はい',
  cancel: 'キャンセル',
  no: 'いいえ',
  delete: '削除する',
  deleteTitle: '削除'
};
