/**
 *  単項目チェックメッセージ
 *  @version 1.0
 *  @author
 */
export const VALID_MESSAGE = {
  E000010: '必須入力項目です。',
  E000020: '半角英数字で入力してください。',
  E000050: '半角英数字記号で入力してください。',
  E000060: '半角数字で入力してください。',
  E000070: '{0}文字以内で入力して下さい。',
  E000080: '{0}文字以上{1}文字以下で入力してください。',
  E010010: '日付の大小関係が不正です。',
  E000100: '有効なメールアドレスではありません。',
  E000110: '{0}文字以上で入力してください。',
  E000120: '{0}桁入力してください。',
  E000130: '全角ではありません。',
  E000140: '半角ではありません。',
  E000150: '有効なパスワードではありません。',
  E000160: '日本語全角を入力してください。',
  E000170: '全角ひらがなまたは半角アルファベットを入力してください。',
  E000180: '{0}以上、{1}以内で入力してください。',
  E000190: '半角英数字及び"."で入力してください。',
  E000200: '全角、半角ｶﾅ及び半角英数字で入力してください。',
  E000210: '半角英数字(アルファベットは大文字)及び半角スペースで入力ください。',
  E000220: '半角ｶﾅ、半角英字（大文字のみ）及び半角スペースで入力ください。',
  E000230: '半角数字及びハイフンで入力してください。',
  E000240: '半角英数字、半角カナ及びハイフンで入力してください。',
  E000250: '半角ｶﾅ及び半角スペースで入力ください。',
  E000260: '半角数字及び半角スペース入力してください。',
};
